@bakito I add an user, a group, and a group-membership resource to my local dev Artifactory:

```sh
alexh@alexh-mac terraform-provider-platform % terraform apply

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # artifactory_managed_user.test-user will be created
  + resource "artifactory_managed_user" "test-user" {
      + admin                      = false
      + disable_ui_access          = true
      + email                      = "test@tempurl.org"
      + groups                     = (known after apply)
      + id                         = (known after apply)
      + internal_password_disabled = false
      + name                       = "test"
      + password                   = (sensitive value)
      + profile_updatable          = true
    }

  # platform_group.test-group will be created
  + resource "platform_group" "test-group" {
      + admin_privileges           = false
      + auto_join                  = true
      + description                = "Test group"
      + name                       = "test-group"
      + realm                      = (known after apply)
      + realm_attributes           = (known after apply)
      + use_group_members_resource = true
    }

  # platform_group_members.test-group will be created
  + resource "platform_group_members" "test-group" {
      + members = [
          + "admin",
          + "anonymous",
          + "test",
        ]
      + name    = "test-group"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

platform_group.test-group: Creating...
artifactory_managed_user.test-user: Creating...
platform_group.test-group: Creation complete after 3s [name=test-group]
artifactory_managed_user.test-user: Creation complete after 2s [id=test]
platform_group_members.test-group: Creating...
platform_group_members.test-group: Creation complete after 1s [name=test-group]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

Then I logged into Artifactory and manually removed the `anonymous` user from the `test-group`. When I ran `terraform plan`, I got the following:

```sh
alexh@alexh-mac terraform-provider-platform % terraform plan
platform_group.test-group: Refreshing state... [name=test-group]
artifactory_managed_user.test-user: Refreshing state... [id=test]
platform_group_members.test-group: Refreshing state... [name=test-group]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # platform_group_members.test-group will be updated in-place
  ~ resource "platform_group_members" "test-group" {
      ~ members = [
          + "anonymous",
            # (2 unchanged elements hidden)
        ]
        name    = "test-group"
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```

Are you not seeing this plan update?